# Reading data
Read the train.csv file as a pandas dataframe.

In [1]:
import pandas as pd
titanic= pd.read_csv("Data/Data/train.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Indexing
1. Create a function that returns the name of a passenger given their PassengerId.
2. Create a function that returns the PassengerId of a passenger given their Name.
3. Print a message with the ID of passenger **Montvila, Rev. Juozas** with the following format: 'The ID pf passenger Montvila, Rev. Juozas is ##'
4. Print a message with the name of the passenger with ID **42** with the following format: 'The passenger with ID 42 is X'
5. Print all information about the oldest passenger.

In [10]:
print("Id del pasajero 'Allen, Mr. William Henry':", get_id(titanic, "Allen, Mr. William Henry"))
#3
Id= get_id(titanic, 'Montvila, Rev. Juozas')
print(f'The Id of passenger Montvila, Rev, Juozas is {Id}')

#4
passenger_name= get_name(titanic, 42)
print(f'The passenger with ID 42 is {passenger_name}')

#5
oldest_passenger=titanic[titanic['Age']== titanic['Age'].max()]
print('Oldest passenger information: ')
print(oldest_passenger)

Id del pasajero 'Allen, Mr. William Henry': 5
The Id of passenger Montvila, Rev, Juozas is 887
The passenger with ID 42 is Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)
Oldest passenger information:
     PassengerId  Survived  Pclass                                  Name  \
630          631         1       1  Barkworth, Mr. Algernon Henry Wilson

      Sex   Age  SibSp  Parch Ticket  Fare Cabin Embarked
630  male  80.0      0      0  27042  30.0   A23        S

In [2]:
from titanic_fns import *

In [5]:
get_name(titanic, 65)

'Stewart, Mr. Albert A'

In [5]:
#1 
titanic[titanic.PassengerId == 1] .Name
def id_to_name(df: pd.DataFrame, id: int ) -> str:
    """Regresa el nombre dek pasajero dado su ID.

    Args:
        df (pd.DataFrame): Conjunto de datos
        id (int): id del pasajero

    Returns:
        str: El nombre del pasajero
    """
    return "Montvila, Rev. Juozas"

id_to_name(titanic, 100)

'Montvila, Rev. Juozas'

In [18]:
passenger = titanic[titanic.PassengerId == 1]. Name
passenger.values[0]

'Braund, Mr. Owen Harris'

In [7]:
x=[i for i in range(100)]
x[:10]

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [8]:
titanic = pd.read_csv("Data/Data/train.csv")
titanic =  titanic.set_index("PassengerId")
titanic

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
titanic.iloc[[1,2,9]]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

# Subseting
We are asked to share data for analysis by a third party. Since our dataset contains personal details, we only want to share with them the following information: ticket classes, fares and port of embarkation. We are asked to deliver a sample of the first 100 rows of this dataset.

6. Create and save the new dataset in **data/port_fares.csv**.

In [10]:
import pandas as pd

titanic = pd.read_csv('Data/Data/train.csv')
subset= titanic[['Pclass', 'Fare', 'Embarked']].head(100)
subset.to_csv('data/port_fares.csv', index=False)
Ds= pd.read_csv('data/port_fares.csv')
print('Numero de filas en el dataset:', len(Ds))
print(Ds.head())
print(Ds.columns)

Numero de filas en el dataset: 100
   Pclass     Fare Embarked
0       3   7.2500        S
1       1  71.2833        C
2       3   7.9250        S
3       1  53.1000        S
4       3   8.0500        S
Index(['Pclass', 'Fare', 'Embarked'], dtype='object')

# Counting
7. We want to know if there were any survivors over the age of 60, print all of their information.
8. How many people over 60 survived?
9. What percentage of people over 60 survived?

In [17]:
titanic= pd.read_csv("Data/Data/train.csv")

survivors = titanic[(titanic["Age"] > 60) & (titanic["Survived"] == 1)]
print(survivors)
count = survivors.shape[0]
print(f"Numero de personas que sobrevivieron mayores a 60: {count}")

total=titanic[titanic['Age']>60].shape[0]
porcentaje= (count/total)*100 if total > 0 else 0
print(f'Porcentaje de sobrevivientes mayores a 60: {porcentaje:.2f}%')

     PassengerId  Survived  Pclass                                       Name  \
275          276         1       1          Andrews, Miss. Kornelia Theodosia
483          484         1       3                     Turkula, Mrs. (Hedwig)
570          571         1       2                         Harris, Mr. George
630          631         1       1       Barkworth, Mr. Algernon Henry Wilson
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)

        Sex   Age  SibSp  Parch       Ticket     Fare Cabin Embarked
275  female  63.0      1      0        13502  77.9583    D7        S
483  female  63.0      0      0         4134   9.5875   NaN        S
570    male  62.0      0      0  S.W./PP 752  10.5000   NaN        S
630    male  80.0      0      0        27042  30.0000   A23        S
829  female  62.0      0      0       113572  80.0000   B28      NaN
Numero de personas que sobrevivieron mayores a 60: 5
Porcentaje de sobrevivientes mayores a 60: 22.73%

# Women and children first?
10. Find out if women and children were more likely to survive.

11. Write a function that returns the percentage of people that survived from a subset given as a boolean Pandas series.

# Summarizing

12. What is the median age of the passengers?
13. How many passengers embarked from each port?

14. Generate two hypotheses about how does the survival rate differ among groups of passengers. Write your code to explore both hypotheses.

# Vectorizacion

In [12]:
import numpy as np

np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [16]:
import time

start=time.time()

total=0
for i in np.arange(10000000):
    total = i+total
print(total)
end =time.time()
print(end -start)

49999995000000
1.2251348495483398

In [17]:
start= time.time()
print(np.sum(np.arange(10000000)))

end=time.time()
print(end-start)

49999995000000
0.009148359298706055